e2e/playwright/fixtures/vcr_cassettes/btcpay_checkout_wallet_transfer.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/products?active=true&expand%5B%5D=data.default_price&ids%5B%5D=prod_SO9GmhAFidiukT&ids%5B%5D=prod_SOA4vfEvazoRti&ids%5B%5D=prod_SOA6phfwu0fqTR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/15.3.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_chYvq7T8XFaPJN","request_duration_ms":241}}'
      Stripe-Version:
      - 2025-06-30.basil
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"15.3.0","lang":"ruby","lang_version":"3.2.8 p263 (2025-03-26)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 6.6.87.2-microsoft-standard-WSL2 (root@439a258ad544) (gcc (GCC) 11.2.0,
        GNU ld (GNU Binutils) 2.37) #1 SMP PREEMPT_DYNAMIC Thu Jun  5 18:30:46 UTC
        2025","hostname":"DESKTOP-TTFCNJ3"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 21 Jul 2025 12:01:14 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4038'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=7YwUlAIQYLu2slaTG-jUJn3k7K_Zx1LQ2kyQglQvYwir3z5ovQBGaE53_7uds-Pj2bKI8RbyhRurhnGk
      Request-Id:
      - req_fzkfCrvRASmDd3
      Stripe-Version:
      - 2025-06-30.basil
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "prod_SO9GmhAFidiukT",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748350230,
              "default_price": {
                "id": "price_1RTMxeIeDQzQhbSLlt6A80i8",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748350230,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": "6 envelopes + 12 credits",
                "product": "prod_SO9GmhAFidiukT",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 1900,
                "unit_amount_decimal": "1900"
              },
              "description": "6 envelopes + 12 credits",
              "images": [
                "https://files.stripe.com/links/MDB8YWNjdF8xTkJIYXRJZURRelFoYlNMfGZsX3Rlc3RfbHZkWW1vaFBZOGZsSk5qRzVocTkwUnNQ00HFJxTKXr"
              ],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "6",
                "slug": "mini",
                "tokens": "12"
              },
              "name": "Mini Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748497552,
              "url": null
            },
            {
              "id": "prod_SOA4vfEvazoRti",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353233,
              "default_price": {
                "id": "price_1RTNk5IeDQzQhbSLX9WPtg2z",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353233,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA4vfEvazoRti",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 2900,
                "unit_amount_decimal": "2900"
              },
              "description": "12 envelopes + 24 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "12",
                "slug": "family",
                "tokens": "24"
              },
              "name": "Family Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404142,
              "url": null
            },
            {
              "id": "prod_SOA6phfwu0fqTR",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353346,
              "default_price": {
                "id": "price_1RTNluIeDQzQhbSL0OFxGeT5",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353346,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA6phfwu0fqTR",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 3900,
                "unit_amount_decimal": "3900"
              },
              "description": "24 envelopes + 42 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "24",
                "slug": "maximalist",
                "tokens": "42"
              },
              "name": "Maximalist Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404159,
              "url": null
            }
          ],
          "has_more": false,
          "url": "/v1/products"
        }
  recorded_at: Mon, 21 Jul 2025 12:01:11 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/products?active=true&expand%5B%5D=data.default_price&ids%5B%5D=prod_SO9GmhAFidiukT&ids%5B%5D=prod_SOA4vfEvazoRti&ids%5B%5D=prod_SOA6phfwu0fqTR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/15.3.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_fzkfCrvRASmDd3","request_duration_ms":376}}'
      Stripe-Version:
      - 2025-06-30.basil
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"15.3.0","lang":"ruby","lang_version":"3.2.8 p263 (2025-03-26)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 6.6.87.2-microsoft-standard-WSL2 (root@439a258ad544) (gcc (GCC) 11.2.0,
        GNU ld (GNU Binutils) 2.37) #1 SMP PREEMPT_DYNAMIC Thu Jun  5 18:30:46 UTC
        2025","hostname":"DESKTOP-TTFCNJ3"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 21 Jul 2025 12:01:18 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4038'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=7YwUlAIQYLu2slaTG-jUJn3k7K_Zx1LQ2kyQglQvYwir3z5ovQBGaE53_7uds-Pj2bKI8RbyhRurhnGk
      Request-Id:
      - req_yb5tITVwQ0ypSY
      Stripe-Version:
      - 2025-06-30.basil
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "prod_SO9GmhAFidiukT",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748350230,
              "default_price": {
                "id": "price_1RTMxeIeDQzQhbSLlt6A80i8",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748350230,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": "6 envelopes + 12 credits",
                "product": "prod_SO9GmhAFidiukT",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 1900,
                "unit_amount_decimal": "1900"
              },
              "description": "6 envelopes + 12 credits",
              "images": [
                "https://files.stripe.com/links/MDB8YWNjdF8xTkJIYXRJZURRelFoYlNMfGZsX3Rlc3RfbHZkWW1vaFBZOGZsSk5qRzVocTkwUnNQ00HFJxTKXr"
              ],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "6",
                "slug": "mini",
                "tokens": "12"
              },
              "name": "Mini Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748497552,
              "url": null
            },
            {
              "id": "prod_SOA4vfEvazoRti",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353233,
              "default_price": {
                "id": "price_1RTNk5IeDQzQhbSLX9WPtg2z",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353233,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA4vfEvazoRti",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 2900,
                "unit_amount_decimal": "2900"
              },
              "description": "12 envelopes + 24 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "12",
                "slug": "family",
                "tokens": "24"
              },
              "name": "Family Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404142,
              "url": null
            },
            {
              "id": "prod_SOA6phfwu0fqTR",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353346,
              "default_price": {
                "id": "price_1RTNluIeDQzQhbSL0OFxGeT5",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353346,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA6phfwu0fqTR",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 3900,
                "unit_amount_decimal": "3900"
              },
              "description": "24 envelopes + 42 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "24",
                "slug": "maximalist",
                "tokens": "42"
              },
              "name": "Maximalist Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404159,
              "url": null
            }
          ],
          "has_more": false,
          "url": "/v1/products"
        }
  recorded_at: Mon, 21 Jul 2025 12:01:15 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/products?active=true&expand%5B%5D=data.default_price&ids%5B%5D=prod_SO9GmhAFidiukT&ids%5B%5D=prod_SOA4vfEvazoRti&ids%5B%5D=prod_SOA6phfwu0fqTR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/15.3.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_yb5tITVwQ0ypSY","request_duration_ms":252}}'
      Stripe-Version:
      - 2025-06-30.basil
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"15.3.0","lang":"ruby","lang_version":"3.2.8 p263 (2025-03-26)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 6.6.87.2-microsoft-standard-WSL2 (root@439a258ad544) (gcc (GCC) 11.2.0,
        GNU ld (GNU Binutils) 2.37) #1 SMP PREEMPT_DYNAMIC Thu Jun  5 18:30:46 UTC
        2025","hostname":"DESKTOP-TTFCNJ3"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 21 Jul 2025 12:01:19 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4038'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; worker-src
        'none'; upgrade-insecure-requests; report-uri https://q.stripe.com/csp-violation?q=7YwUlAIQYLu2slaTG-jUJn3k7K_Zx1LQ2kyQglQvYwir3z5ovQBGaE53_7uds-Pj2bKI8RbyhRurhnGk
      Request-Id:
      - req_1FkT3aEoox5kgv
      Stripe-Version:
      - 2025-06-30.basil
      Vary:
      - Origin
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - ABGHIJ
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "object": "list",
          "data": [
            {
              "id": "prod_SO9GmhAFidiukT",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748350230,
              "default_price": {
                "id": "price_1RTMxeIeDQzQhbSLlt6A80i8",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748350230,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": "6 envelopes + 12 credits",
                "product": "prod_SO9GmhAFidiukT",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 1900,
                "unit_amount_decimal": "1900"
              },
              "description": "6 envelopes + 12 credits",
              "images": [
                "https://files.stripe.com/links/MDB8YWNjdF8xTkJIYXRJZURRelFoYlNMfGZsX3Rlc3RfbHZkWW1vaFBZOGZsSk5qRzVocTkwUnNQ00HFJxTKXr"
              ],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "6",
                "slug": "mini",
                "tokens": "12"
              },
              "name": "Mini Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748497552,
              "url": null
            },
            {
              "id": "prod_SOA4vfEvazoRti",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353233,
              "default_price": {
                "id": "price_1RTNk5IeDQzQhbSLX9WPtg2z",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353233,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA4vfEvazoRti",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 2900,
                "unit_amount_decimal": "2900"
              },
              "description": "12 envelopes + 24 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "12",
                "slug": "family",
                "tokens": "24"
              },
              "name": "Family Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404142,
              "url": null
            },
            {
              "id": "prod_SOA6phfwu0fqTR",
              "object": "product",
              "active": true,
              "attributes": [],
              "created": 1748353346,
              "default_price": {
                "id": "price_1RTNluIeDQzQhbSL0OFxGeT5",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1748353346,
                "currency": "eur",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_SOA6phfwu0fqTR",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 3900,
                "unit_amount_decimal": "3900"
              },
              "description": "24 envelopes + 42 credits",
              "images": [],
              "livemode": false,
              "marketing_features": [],
              "metadata": {
                "envelopes": "24",
                "slug": "maximalist",
                "tokens": "42"
              },
              "name": "Maximalist Pack",
              "package_dimensions": null,
              "shippable": null,
              "statement_descriptor": null,
              "tax_code": null,
              "type": "service",
              "unit_label": null,
              "updated": 1748404159,
              "url": null
            }
          ],
          "has_more": false,
          "url": "/v1/products"
        }
  recorded_at: Mon, 21 Jul 2025 12:01:19 GMT
- request:
    method: post
    uri: https://testnet.demo.btcpayserver.org/api/v1/stores/5J8edsBQADQ17kfw2iLbQ23PX79Lbc1wTWGqwzCBm5rR/invoices
    body:
      encoding: UTF-8
      string: '{"amount":"19.0","currency":"EUR","checkout":{"speedPolicy":"MediumSpeed","defaultPaymentMethod":"BTC","redirectURL":"http://localhost:3003/checkout/success?provider=btcpay\u0026session_id=142a2cf36e9e626ffe08540d954d1db8","redirectAutomatically":true},"metadata":{"redirectRef":"142a2cf36e9e626ffe08540d954d1db8","currency":"EUR","amount":19.0,"color":"red","description":"6
        envelopes + 12 credits","envelopes":6,"tokens":12,"title":"Mini Pack","itemDesc":"Red
        Mini Pack - 6 envelopes + 12 credits","itemCode":"price_1RTMxeIeDQzQhbSLlt6A80i8","physical":"true","userId":"guest","buyerEmail":"test@example.com","buyerName":"Satoshi
        Nakamoto","buyerAddress1":"123 Bitcoin Plaza","buyerAddress2":"","buyerCity":"Crypto
        City","buyerState":"Tokyo","buyerZip":"12345","buyerCountry":"JP"}}'
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Host:
      - testnet.demo.btcpayserver.org
      Authorization:
      - token <BTCPAY_API_KEY>
      Content-Type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 21 Jul 2025 12:01:21 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - UserPrefsCookie=%7B%22InvoicesQuery%22%3Anull%2C%22PaymentRequestsQuery%22%3Anull%2C%22UsersQuery%22%3Anull%2C%22PayoutsQuery%22%3Anull%2C%22PullPaymentsQuery%22%3Anull%2C%22CurrentStoreId%22%3A%225J8edsBQADQ17kfw2iLbQ23PX79Lbc1wTWGqwzCBm5rR%22%7D;
        path=/
      Content-Security-Policy:
      - script-src 'self'
      Referrer-Policy:
      - same-origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - DENY
      Strict-Transport-Security:
      - max-age=31536000
    body:
      encoding: ASCII-8BIT
      string: '{"id":"U5yceUov7PgDDXwgaHfz2i","storeId":"5J8edsBQADQ17kfw2iLbQ23PX79Lbc1wTWGqwzCBm5rR","amount":"19.0","paidAmount":"0","checkoutLink":"https://testnet.demo.btcpayserver.org/i/U5yceUov7PgDDXwgaHfz2i","status":"New","additionalStatus":"None","monitoringExpiration":1753186580,"expirationTime":1753100180,"createdTime":1753099280,"availableStatusesForManualMarking":["Settled","Invalid"],"archived":false,"type":"Standard","currency":"EUR","metadata":{"redirectRef":"142a2cf36e9e626ffe08540d954d1db8","currency":"EUR","amount":19.0,"color":"red","description":"6
        envelopes + 12 credits","envelopes":6,"tokens":12,"title":"Mini Pack","itemDesc":"Red
        Mini Pack - 6 envelopes + 12 credits","itemCode":"price_1RTMxeIeDQzQhbSLlt6A80i8","physical":"true","userId":"guest","buyerEmail":"test@example.com","buyerName":"Satoshi
        Nakamoto","buyerAddress1":"123 Bitcoin Plaza","buyerAddress2":"","buyerCity":"Crypto
        City","buyerState":"Tokyo","buyerZip":"12345","buyerCountry":"JP"},"checkout":{"speedPolicy":"MediumSpeed","paymentMethods":["BTC-LN","BTC-CHAIN","BTC-LNURL"],"defaultPaymentMethod":"BTC-CHAIN","expirationMinutes":15,"monitoringMinutes":1440,"paymentTolerance":0.0,"redirectURL":"http://localhost:3003/checkout/success?provider=btcpay&session_id=142a2cf36e9e626ffe08540d954d1db8","redirectAutomatically":true,"defaultLanguage":null,"lazyPaymentMethods":null},"receipt":{"enabled":true,"showQR":true,"showPayments":true}}'
  recorded_at: Mon, 21 Jul 2025 12:01:21 GMT
recorded_with: VCR 6.3.1
